"""Константы
Дополнительных команд для создания констант в языке Python нет. Есть лишь
договорённость что константа — это переменная написанное прописными буквами.
Примеры констант."""

MAX_COUNT = 1000
ZERO = 0
DATA_AFTER_DELETE = 'No data'
DAY = 60 * 60 * 24

"""Константа в программировании — способ адресации данных, изменение которых
программой не предполагается или запрещается. Python не вызовет исключение,
если вы измените константу внутри кода. Но подобные действия со стороны
программиста являются неверными.

True, False, None
Отдельно хочу выделить три встроенные в язык Python константы. Это истина True,
ложь False и ничего None. Первая буква строчная остальные прописные. Истину или
ложь мы получаем в результате логических операций. О них мы поговорим чуть
позже Значение None означает "ничего". Его можно использовать для создания
переменной, значение которой изначально мы не знаем. Также None возвращают
некоторые функции, результат работы которых не подразумевает возврат значения."""