"""
Зарезервированные слова, keyword.kwlist
Существует чуть менее 40 зарезервированных слов, которые образуют базовый
синтаксис языка Python. Ниже представлены они все.
False, None, True, and, as, assert, async, await, break, class,
continue, def, del, elif, else, except, finally, for, from,
global, if, import, in, is, lambda, nonlocal, not, or, pass,
raise, return, try, while, with, yield.
А также case и match начиная с версии Python 3.10.
Первую Троицу из списка мы разобрали, когда говорили о встроенных в Python
константах. О остальных зарезервированных словах мы будем говорить далее на
протяжении всего курса. Уверен, что некоторые слова вам знакомы по прошлым
курсам и другим языкам программирования.
🔥 Важно! Запрещено использовать в качестве имён переменных
зарезервированные слова. Python завершить код с ошибкой.
"""