"""Обзор библиотеки целиком

Мы уже упоминали стандартную библиотеку Python на курсе. Даже использовали
некоторый пакеты из неё. Вспомним, что же это такое.

Стандартная библиотека Python (The Python Standard Library) — распространяется
вместе с интерпретатором Python. Следовательно для использования пакетов и
модулей из неё достаточно написать import name.

Предлагаю для краткости называть Стандартную библиотеку Python просто
библиотека в рамках этой лекции.

Библиотека очень обширна и позволяет решать огромный спектр задач. Внутри есть
модули написанные на языке C. Благодаря ним у разработчиков есть лёгкий доступ
к системным функциям. Другие модули написаны на Python и предлагают готовые
решения для повседневных задач программирования.


Библиотека содержит:

● Встроенные функции
● Встроенные константы
● Встроенные типы
● Встроенные исключения
● Услуги обработки текста
● Службы двоичных данных
● Типы данных
● Числовые и математические модули
● Модули функционального программирования
● Доступ к файлам и каталогам
● Сохранение данных
● Сжатие данных и архивирование
● Форматы файлов
● Криптографические услуги
● Общие службы операционной системы
● Параллельное выполнение
● Сеть и межпроцессное взаимодействие
● Обработка данных в Интернете
● Инструменты обработки структурированной разметки
● Интернет-протоколы и поддержка
● Мультимедийные услуги
● Интернационализация
● Программные фреймворки
● Графические пользовательские интерфейсы с Tk
● Инструменты разработки
● Отладка и профилирование
● Упаковка и распространение программного обеспечения
● Службы выполнения Python
● Пользовательские интерпретаторы Python
● Импорт модулей
● Языковые службы Python
● Специальные службы MS Windows
● Специальные службы Unix
● Замененные (устаревшие) модули

И под каждым пунктом кроется несколько пакетов для решения соответствующих
теме задач. Вы можете перейти по ссылке и увидеть детальный состав библиотеки
самостоятельно https://docs.python.org/3.11/library/index.html.

Далее в рамках лекции рассмотрим несколько полезных модулей.
"""