"""
Модель logging

Модуль logging позволяет регистрировать события в приложениях. Для этого
разработчику предоставляется гибкая система классов и функций. Традиционно
начнём с простого примера.

import logging

logging.info('Немного информации')
logging.error('Поймали ошибку')

В результата получим строку:

# ERROR:root:Поймали ошибку

Мы не увидели в консоли первое сообщение. По умолчанию модуль не реагирует на
информационные сообщения. При этом логгер сообщил об ошибке от имени
корневого регистратора — root.


Уровни логирования

По умолчанию логгер имеет следующие уровни журналирования

● NOTSET, 0 — уровень не установлен. Регистрируются все события.
● DEBUG, 10 — подробная информация, обычно представляющая интерес
только при диагностике проблем.
● INFO, 20 — подтверждение того, что все работает так, как ожидалось.
● WARNING, 30 — указание на то, что произошло что-то неожиданное, или
указание на какую-то проблему в ближайшем будущем (например,
«недостаточно места на диске»). Программное обеспечение по-прежнему
работает, как ожидалось.
● ERROR, 40 — из-за более серьезной проблемы программное обеспечение не
может выполнять некоторые функции.
● CRITICAL, 50 — серьезная ошибка, указывающая на то, что сама программа не
может продолжать работу.

Уровень NOTSET используется как значение по умолчанию при создании
обработчиков событий. Все остальные уровни имеют одноимённые функции —
регистраторы, которые позволяют зафиксировать события заданного уровня.
Кроме того уровни имеют числовой эквивалент от 0 до 50. Он нужен при создании
своих уровней логирования, чтобы определить место обработчика относительно
базовых.


🔥 Важно! На протяжении курса мы использовали функцию print() чтобы
посмотреть отладочную информацию в том или ином коде. Обычно, но не
всегда, рядом с таким принтом составлялся комментарий, что этот вывод для
учебных целей, а не для реальных проектов. Правильно было бы использовать
логирование уровня debug или info вместо функции print.




Базовые регистраторы

Имена функций для регистрации событий совпадают с названиями констант для
определения уровня логирования. Перечислим их в примере кода.

import logging

logging.basicConfig(level=logging.NOTSET)
logging.debug('Очень подробная отладочная информация. Заменяем множество "принтов"')
logging.info('Немного информации о работе кода')
logging.warning('Внимание! Надвигается буря!')
logging.error('Поймали ошибку. Дальше только неизвестность')
logging.critical('На этом всё')


Разработчик сам выбирает какой уровень использовать для регистрации того или
иного события в его коде.

Обычно в коде не используют прямое обращение к регистраторам через имя
модуля. В официальное документации указано, что работать с регистраторами
напрямую запрещено. Необходимо использовать функцию уровня модуля
logging.getLogger(name) для получения регистраторов. В таком случае пример выше
должен выглядеть так:"""

import logging

logging.basicConfig(level=logging.NOTSET)
logger1 = logging.getLogger(__name__)
logger1.debug('111. Очень подробная отладочная информация. Заменяем множество "принтов"')
logger1.info('111. Немного информации о работе кода')
logger1.warning('111. Внимание! Надвигается буря!')
logger1.error('111. Поймали ошибку. Дальше только неизвестность')
logger1.critical('111. На этом всё\n\n\n')



"""Напомним, что переменная __name__ хранит имя модуля. Если мы запускаем
модуль как исполняемый файл, в __name__ хранится __main__. Если файл
импортирован, __name__ хранит имя файла.


А теперь рассмотрим ситуацию с несколькими файлами, когда мы работаем со
сложным проектом.
Код основного файла:"""

import logging
from other import log_all

logging.basicConfig(level=logging.WARNING)
logger = logging.getLogger('Основной файл проекта')
logger.warning('Внимание! Используем вызов функции из другого модуля')
log_all()

"""Код другого файла в проекте"""

"""В основном коде определили уровень логирования - WARNING. Логер вывел
сообщение и вместо root указал текст, переданный в функцию getLogger.
Далее мы вызываем импортированную функцию и…
В файле other так же импортирован модуль logging. Далее мы получаем регистратор
с именем other, оно содержится в __name__. И не смотря на попытку использовать
все уровни логирования, срабатывают только предупреждения и выше. Функция
getLogger взяла конфигурацию basicConfig из основного файла проекта.
"""
